'''Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
который должен принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
Примеры матриц вы найдете в методичке.
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.
'''
import numpy as np

class Matrix():


    def __init__(self, matrix):
        self.matrix = np.array(matrix)

    
    def __str__(self):
        return str(self.matrix)

    def __add__(self, other):
        return self.matrix + other.matrix

a = Matrix([[1,2], [2,2]])
b = Matrix([[7,8], [11,15]])
c = a + b
print(a+b+c)